// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. 
// Выполнить с помощью числовых операций (целочисленное деление, остаток от деления).

// 456 -> 5
// 782 -> 8
// 918 -> 1

Console.WriteLine("Введите трехзначное число:");
int number = Convert.ToInt32(Console.ReadLine());

if(99<number & number<1000)
{
   int secondDigital = (number/10) % 10;
   Console.WriteLine(secondDigital);
}
else 
{
Console.WriteLine("Некорректное число");
}